cask_args appdir: '/Applications'

tap 'homebrew/services'
tap 'caskroom/cask'

cask 'java' unless system "/usr/libexec/java_home --failfast"

brew 'tree'
brew 'coreutils'
brew 'jq'
brew 'diffutils'
brew 'vim'
brew 'node'
brew 'yarn'
brew 'gradle'
brew 'maven'
brew 'wget'
brew 'nginx'
brew 'redis'
brew 'mysql'
brew 'bash-completion'
brew 'terraform'
brew 'tmux'

cask 'google-chrome'
cask 'dropbox'
cask 'alfred'
cask 'slack'
cask 'iterm2'
cask 'spotify'
cask 'sourcetree'
cask 'postman'
cask 'atom'
cask 'sip'
